In [1]:
import pandas as pd
import numpy as np

In [31]:
df=pd.read_csv('titanic_dataset.csv',index_col=0)
#index_col is 0 instead of None (take first column as index by default)

In [32]:
df.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [13]:
#Read data and describe it
df.describe()

,Unnamed: 0,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,654.000000,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,378.020061,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,0.000000,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,327.000000,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,654.000000,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,981.000000,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,1308.000000,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
Unnamed: 0    1309 non-null int64
pclass        1309 non-null int64
survived      1309 non-null int64
name          1309 non-null object
gender        1309 non-null object
age           1046 non-null float64
sibsp         1309 non-null int64
parch         1309 non-null int64
ticket        1309 non-null object
fare          1308 non-null object
cabin         295 non-null object
embarked      1307 non-null object
boat          486 non-null object
body          121 non-null float64
home.dest     745 non-null object
dtypes: float64(2), int64(5), object(8)
memory usage: 153.5+ KB

In [66]:
#Print shape of dataset
print(df.shape)
print(df.size)
print(len(df))
print()
print(df.columns)
print()
print(df.index)
print(len(df.columns))
print(len(df.index))

(1309, 14)
18326
1309

Index(['pclass', 'survived', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1299, 1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308],
           dtype='int64', length=1309)
14
1309

In [46]:
#Find columns with missingdata
df.isna().sum()
#df.isna().any()
#df.columns[df.isna().any()]

pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [47]:
df.isna().any()

pclass       False
survived     False
name         False
gender       False
age           True
sibsp        False
parch        False
ticket       False
fare          True
cabin         True
embarked      True
boat          True
body          True
home.dest     True
dtype: bool

In [48]:
df.columns[df.isna().any()]

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [72]:
#drop columns with more than 25% missing data
df.dropna(axis=1,thresh=len(df)*.75,inplace=True)
df.head()
df

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,S
...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,$14.45,C
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,$14.45,C
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,$7.23,C
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,$7.23,C
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,$7.88,S

In [90]:
#drop columns having independent values(which do not affect the survival rate)
df.drop(['name','ticket'],axis=1,inplace=True)

KeyError: "['name' 'ticket'] not found in axis"

In [91]:
df.head()

   pclass  survived  gender      age  sibsp  parch      fare embarked
0       1         1  female  29.0000      0      0  $211.34         S
1       1         1    male   0.9167      1      2  $151.55         S
2       1         0  female   2.0000      1      2  $151.55         S
3       1         0    male  30.0000      1      2  $151.55         S
4       1         0  female  25.0000      1      2  $151.55         S

In [95]:
#check data types of all columns
print(df.dtypes)
print()
print(df.info())

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
fare         object
embarked     object
dtype: object

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 1308
Data columns (total 8 columns):
pclass      1309 non-null int64
survived    1309 non-null int64
gender      1309 non-null object
age         1046 non-null float64
sibsp       1309 non-null int64
parch       1309 non-null int64
fare        1308 non-null object
embarked    1307 non-null object
dtypes: float64(1), int64(4), object(3)
memory usage: 92.0+ KB
None

In [109]:
#convert price to numeric
df['fare']=df['fare'].str.replace('$','').astype('float32')

In [111]:
df.dtypes

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
fare        float32
embarked     object
dtype: object

In [112]:
#find columns still having missing/na values and also count of missing data
df.isna().sum()

pclass        0
survived      0
gender        0
age         263
sibsp         0
parch         0
fare          1
embarked      2
dtype: int64

In [117]:
df.columns[df.isna().any()]

Index(['age', 'fare', 'embarked'], dtype='object')

          age        fare embarked
0     29.0000  211.339996        S
1      0.9167  151.550003        S
2      2.0000  151.550003        S
3     30.0000  151.550003        S
4     25.0000  151.550003        S
...       ...         ...      ...
1304  14.5000   14.450000        C
1305      NaN   14.450000        C
1306  26.5000    7.230000        C
1307  27.0000    7.230000        C
1308  29.0000    7.880000        S

[1309 rows x 3 columns]

In [118]:
# fill na with mean for fare and age column column.
df.fillna({'age':df['age'].mean(),'fare':df['fare'].mean(),},inplace=True)

In [119]:
df.columns[df.isna().any()]

Index(['embarked'], dtype='object')

In [124]:
#drop na values for embarked column.
df.dropna(axis=1,inplace=True)

In [125]:
df

      pclass  survived  gender        age  sibsp  parch        fare
0          1         1  female  29.000000      0      0  211.339996
1          1         1    male   0.916700      1      2  151.550003
2          1         0  female   2.000000      1      2  151.550003
3          1         0    male  30.000000      1      2  151.550003
4          1         0  female  25.000000      1      2  151.550003
...      ...       ...     ...        ...    ...    ...         ...
1304       3         0  female  14.500000      1      0   14.450000
1305       3         0  female  29.881135      1      0   14.450000
1306       3         0    male  26.500000      0      0    7.230000
1307       3         0    male  27.000000      0      0    7.230000
1308       3         0    male  29.000000      0      0    7.880000

[1309 rows x 7 columns]

In [126]:
df.isnull().sum()

pclass      0
survived    0
gender      0
age         0
sibsp       0
parch       0
fare        0
dtype: int64

In [127]:
#dump the dataframe to a csv file 'titanic_filtered.csv'.
df.to_csv("titanic_filtered_raj.csv")

In [131]:
#for surviced column replace 0 with D and 1 with A
df.survived.replace({0:'D',1:'A'},inplace=True)

In [134]:
df.survived

0       A
1       A
2       D
3       D
4       D
       ..
1304    D
1305    D
1306    D
1307    D
1308    D
Name: survived, Length: 1309, dtype: object

In [142]:
#find the frequency of different values in survived column
df.survived.value_counts()

D    809
A    500
Name: survived, dtype: int64

In [153]:
#group by gender and survived and see the counts in each category
gp=df.groupby(by=['gender','survived'])

In [154]:
gp.count()

                 pclass  age  sibsp  parch  fare
gender survived
female A            339  339    339    339   339
       D            127  127    127    127   127
male   A            161  161    161    161   161
       D            682  682    682    682   682

In [156]:
#find different pclass and no of people in each class
df.pclass.unique()

array([1, 2, 3], dtype=int64)

In [170]:
df.groupby('pclass').size()
#without using groupby df['pclass'].value_counts()

pclass
1    323
2    277
3    709
dtype: int64

In [171]:
#find top 5 people with highest values of age. Count no of male and females in the top 5
df.nlargest(n=5,columns='age')

      pclass survived  gender   age  sibsp  parch       fare
14         1        A    male  80.0      0      0  30.000000
61         1        A  female  76.0      1      0  78.849998
1235       3        D    male  74.0      0      0   7.780000
9          1        D    male  71.0      0      0  49.500000
135        1        D    male  71.0      0      0  34.650002

In [178]:
dft=df.nlargest(n=5,columns='age')
dft.gender.value_counts()

male      4
female    1
Name: gender, dtype: int64

In [179]:
df.nlargest(n=5,columns='age').gender.value_counts()

male      4
female    1
Name: gender, dtype: int64

In [209]:
#find max age male and female who survived
df[df['survived']=='A'].groupby('gender').max()['age']

gender
female    76.0
male      80.0
Name: age, dtype: float64

In [211]:
#get average age by gender
df.groupby('gender').mean()

          pclass        age     sibsp     parch       fare
gender
female  2.154506  28.886935  0.652361  0.633047  46.198669
male    2.372479  30.430716  0.413998  0.247924  26.163969

In [213]:
#get average age by people survived vs not-survived
df.groupby('survived').mean()

            pclass        age     sibsp     parch       fare
survived
A         1.962000  29.058812  0.462000  0.476000  49.361839
D         2.500618  30.389368  0.521632  0.328801  23.366980